RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_reg.h
/* 0x0C : mjpeg_uv_frame_addr */
#define MJPEG_UV_FRAME_ADDR_OFFSET   (0x0C)
#define MJPEG_REG_UV_ADDR_START      MJPEG_REG_UV_ADDR_START
#define MJPEG_REG_UV_ADDR_START_POS  (0U)
#define MJPEG_REG_UV_ADDR_START_LEN  (32U)
#define MJPEG_REG_UV_ADDR_START_MSK  (((1U << MJPEG_REG_UV_ADDR_START_LEN) - 1) << MJPEG_REG_UV_ADDR_START_POS)
#define MJPEG_REG_UV_ADDR_START_UMSK (~(((1U << MJPEG_REG_UV_ADDR_START_LEN) - 1) << MJPEG_REG_UV_ADDR_START_POS))

/* 0x10 : mjpeg_yuv_mem */
#define MJPEG_YUV_MEM_OFFSET       (0x10)
#define MJPEG_REG_YY_MEM_HBLK      MJPEG_REG_YY_MEM_HBLK
#define MJPEG_REG_YY_MEM_HBLK_POS  (0U)
#define MJPEG_REG_YY_MEM_HBLK_LEN  (13U)
#define MJPEG_REG_YY_MEM_HBLK_MSK  (((1U << MJPEG_REG_YY_MEM_HBLK_LEN) - 1) << MJPEG_REG_YY_MEM_HBLK_POS)
#define MJPEG_REG_YY_MEM_HBLK_UMSK (~(((1U << MJPEG_REG_YY_MEM_HBLK_LEN) - 1) << MJPEG_REG_YY_MEM_HBLK_POS))
#define MJPEG_REG_UV_MEM_HBLK      MJPEG_REG_UV_MEM_HBLK
#define MJPEG_REG_UV_MEM_HBLK_POS  (16U)
#define MJPEG_REG_UV_MEM_HBLK_LEN  (13U)
#define MJPEG_REG_UV_MEM_HBLK_MSK  (((1U << MJPEG_REG_UV_MEM_HBLK_LEN) - 1) << MJPEG_REG_UV_MEM_HBLK_POS)
#define MJPEG_REG_UV_MEM_HBLK_UMSK (~(((1U << MJPEG_REG_UV_MEM_HBLK_LEN) - 1) << MJPEG_REG_UV_MEM_HBLK_POS))

/* 0x14 : jpeg_frame_addr */
#define MJPEG_JPEG_FRAME_ADDR_OFFSET (0x14)
#define MJPEG_REG_W_ADDR_START       MJPEG_REG_W_ADDR_START
#define MJPEG_REG_W_ADDR_START_POS   (0U)
#define MJPEG_REG_W_ADDR_START_LEN   (32U)
#define MJPEG_REG_W_ADDR_START_MSK   (((1U << MJPEG_REG_W_ADDR_START_LEN) - 1) << MJPEG_REG_W_ADDR_START_POS)
#define MJPEG_REG_W_ADDR_START_UMSK  (~(((1U << MJPEG_REG_W_ADDR_START_LEN) - 1) << MJPEG_REG_W_ADDR_START_POS))

/* 0x18 : jpeg_store_memory */
#define MJPEG_JPEG_STORE_MEMORY_OFFSET (0x18)
#define MJPEG_REG_W_BURST_CNT          MJPEG_REG_W_BURST_CNT
#define MJPEG_REG_W_BURST_CNT_POS      (0U)
#define MJPEG_REG_W_BURST_CNT_LEN      (32U)
#define MJPEG_REG_W_BURST_CNT_MSK      (((1U << MJPEG_REG_W_BURST_CNT_LEN) - 1) << MJPEG_REG_W_BURST_CNT_POS)
#define MJPEG_REG_W_BURST_CNT_UMSK     (~(((1U << MJPEG_REG_W_BURST_CNT_LEN) - 1) << MJPEG_REG_W_BURST_CNT_POS))

/* 0x1C : mjpeg_control_3 */
#define MJPEG_CONTROL_3_OFFSET            (0x1C)
#define MJPEG_REG_INT_NORMAL_EN           MJPEG_REG_INT_NORMAL_EN
#define MJPEG_REG_INT_NORMAL_EN_POS       (0U)
#define MJPEG_REG_INT_NORMAL_EN_LEN       (1U)
#define MJPEG_REG_INT_NORMAL_EN_MSK       (((1U << MJPEG_REG_INT_NORMAL_EN_LEN) - 1) << MJPEG_REG_INT_NORMAL_EN_POS)
#define MJPEG_REG_INT_NORMAL_EN_UMSK      (~(((1U << MJPEG_REG_INT_NORMAL_EN_LEN) - 1) << MJPEG_REG_INT_NORMAL_EN_POS))
#define MJPEG_REG_INT_CAM_EN              MJPEG_REG_INT_CAM_EN
#define MJPEG_REG_INT_CAM_EN_POS          (1U)
#define MJPEG_REG_INT_CAM_EN_LEN          (1U)
#define MJPEG_REG_INT_CAM_EN_MSK          (((1U << MJPEG_REG_INT_CAM_EN_LEN) - 1) << MJPEG_REG_INT_CAM_EN_POS)
#define MJPEG_REG_INT_CAM_EN_UMSK         (~(((1U << MJPEG_REG_INT_CAM_EN_LEN) - 1) << MJPEG_REG_INT_CAM_EN_POS))
#define MJPEG_REG_INT_MEM_EN              MJPEG_REG_INT_MEM_EN
#define MJPEG_REG_INT_MEM_EN_POS          (2U)
#define MJPEG_REG_INT_MEM_EN_LEN          (1U)
#define MJPEG_REG_INT_MEM_EN_MSK          (((1U << MJPEG_REG_INT_MEM_EN_LEN) - 1) << MJPEG_REG_INT_MEM_EN_POS)
#define MJPEG_REG_INT_MEM_EN_UMSK         (~(((1U << MJPEG_REG_INT_MEM_EN_LEN) - 1) << MJPEG_REG_INT_MEM_EN_POS))
#define MJPEG_REG_INT_FRAME_EN            MJPEG_REG_INT_FRAME_EN
#define MJPEG_REG_INT_FRAME_EN_POS        (3U)
#define MJPEG_REG_INT_FRAME_EN_LEN        (1U)
#define MJPEG_REG_INT_FRAME_EN_MSK        (((1U << MJPEG_REG_INT_FRAME_EN_LEN) - 1) << MJPEG_REG_INT_FRAME_EN_POS)
#define MJPEG_REG_INT_FRAME_EN_UMSK       (~(((1U << MJPEG_REG_INT_FRAME_EN_LEN) - 1) << MJPEG_REG_INT_FRAME_EN_POS))
#define MJPEG_STS_NORMAL_INT              MJPEG_STS_NORMAL_INT
#define MJPEG_STS_NORMAL_INT_POS          (4U)
#define MJPEG_STS_NORMAL_INT_LEN          (1U)
#define MJPEG_STS_NORMAL_INT_MSK          (((1U << MJPEG_STS_NORMAL_INT_LEN) - 1) << MJPEG_STS_NORMAL_INT_POS)
#define MJPEG_STS_NORMAL_INT_UMSK         (~(((1U << MJPEG_STS_NORMAL_INT_LEN) - 1) << MJPEG_STS_NORMAL_INT_POS))
#define MJPEG_STS_CAM_INT                 MJPEG_STS_CAM_INT
#define MJPEG_STS_CAM_INT_POS             (5U)
#define MJPEG_STS_CAM_INT_LEN             (1U)
#define MJPEG_STS_CAM_INT_MSK             (((1U << MJPEG_STS_CAM_INT_LEN) - 1) << MJPEG_STS_CAM_INT_POS)
#define MJPEG_STS_CAM_INT_UMSK            (~(((1U << MJPEG_STS_CAM_INT_LEN) - 1) << MJPEG_STS_CAM_INT_POS))
#define MJPEG_STS_MEM_INT                 MJPEG_STS_MEM_INT
#define MJPEG_STS_MEM_INT_POS             (6U)
#define MJPEG_STS_MEM_INT_LEN             (1U)
#define MJPEG_STS_MEM_INT_MSK             (((1U << MJPEG_STS_MEM_INT_LEN) - 1) << MJPEG_STS_MEM_INT_POS)
#define MJPEG_STS_MEM_INT_UMSK            (~(((1U << MJPEG_STS_MEM_INT_LEN) - 1) << MJPEG_STS_MEM_INT_POS))
#define MJPEG_STS_FRAME_INT               MJPEG_STS_FRAME_INT
#define MJPEG_STS_FRAME_INT_POS           (7U)
#define MJPEG_STS_FRAME_INT_LEN           (1U)
#define MJPEG_STS_FRAME_INT_MSK           (((1U << MJPEG_STS_FRAME_INT_LEN) - 1) << MJPEG_STS_FRAME_INT_POS)
#define MJPEG_STS_FRAME_INT_UMSK          (~(((1U << MJPEG_STS_FRAME_INT_LEN) - 1) << MJPEG_STS_FRAME_INT_POS))
#define MJPEG_IDLE                        MJPEG_IDLE
#define MJPEG_IDLE_POS                    (8U)
#define MJPEG_IDLE_LEN                    (1U)
#define MJPEG_IDLE_MSK                    (((1U << MJPEG_IDLE_LEN) - 1) << MJPEG_IDLE_POS)
#define MJPEG_IDLE_UMSK                   (~(((1U << MJPEG_IDLE_LEN) - 1) << MJPEG_IDLE_POS))
#define MJPEG_FUNC                        MJPEG_FUNC
#define MJPEG_FUNC_POS                    (9U)
#define MJPEG_FUNC_LEN                    (1U)
#define MJPEG_FUNC_MSK                    (((1U << MJPEG_FUNC_LEN) - 1) << MJPEG_FUNC_POS)
#define MJPEG_FUNC_UMSK                   (~(((1U << MJPEG_FUNC_LEN) - 1) << MJPEG_FUNC_POS))
#define MJPEG_WAIT                        MJPEG_WAIT
#define MJPEG_WAIT_POS                    (10U)
#define MJPEG_WAIT_LEN                    (1U)
#define MJPEG_WAIT_MSK                    (((1U << MJPEG_WAIT_LEN) - 1) << MJPEG_WAIT_POS)
#define MJPEG_WAIT_UMSK                   (~(((1U << MJPEG_WAIT_LEN) - 1) << MJPEG_WAIT_POS))
#define MJPEG_FLSH                        MJPEG_FLSH
#define MJPEG_FLSH_POS                    (11U)
#define MJPEG_FLSH_LEN                    (1U)
#define MJPEG_FLSH_MSK                    (((1U << MJPEG_FLSH_LEN) - 1) << MJPEG_FLSH_POS)
#define MJPEG_FLSH_UMSK                   (~(((1U << MJPEG_FLSH_LEN) - 1) << MJPEG_FLSH_POS))
#define MJPEG_MANS                        MJPEG_MANS
#define MJPEG_MANS_POS                    (12U)
#define MJPEG_MANS_LEN                    (1U)
#define MJPEG_MANS_MSK                    (((1U << MJPEG_MANS_LEN) - 1) << MJPEG_MANS_POS)
#define MJPEG_MANS_UMSK                   (~(((1U << MJPEG_MANS_LEN) - 1) << MJPEG_MANS_POS))
#define MJPEG_MANF                        MJPEG_MANF
#define MJPEG_MANF_POS                    (13U)
#define MJPEG_MANF_LEN                    (1U)
#define MJPEG_MANF_MSK                    (((1U << MJPEG_MANF_LEN) - 1) << MJPEG_MANF_POS)
#define MJPEG_MANF_UMSK                   (~(((1U << MJPEG_MANF_LEN) - 1) << MJPEG_MANF_POS))
#define MJPEG_AXI_READ_IDLE               MJPEG_AXI_READ_IDLE
#define MJPEG_AXI_READ_IDLE_POS           (14U)
#define MJPEG_AXI_READ_IDLE_LEN           (1U)
#define MJPEG_AXI_READ_IDLE_MSK           (((1U << MJPEG_AXI_READ_IDLE_LEN) - 1) << MJPEG_AXI_READ_IDLE_POS)
#define MJPEG_AXI_READ_IDLE_UMSK          (~(((1U << MJPEG_AXI_READ_IDLE_LEN) - 1) << MJPEG_AXI_READ_IDLE_POS))
#define MJPEG_AXI_WRITE_IDLE              MJPEG_AXI_WRITE_IDLE
#define MJPEG_AXI_WRITE_IDLE_POS          (15U)
#define MJPEG_AXI_WRITE_IDLE_LEN          (1U)
#define MJPEG_AXI_WRITE_IDLE_MSK          (((1U << MJPEG_AXI_WRITE_IDLE_LEN) - 1) << MJPEG_AXI_WRITE_IDLE_POS)
#define MJPEG_AXI_WRITE_IDLE_UMSK         (~(((1U << MJPEG_AXI_WRITE_IDLE_LEN) - 1) << MJPEG_AXI_WRITE_IDLE_POS))
#define MJPEG_REG_FRAME_CNT_TRGR_INT      MJPEG_REG_FRAME_CNT_TRGR_INT
#define MJPEG_REG_FRAME_CNT_TRGR_INT_POS  (16U)
#define MJPEG_REG_FRAME_CNT_TRGR_INT_LEN  (5U)
#define MJPEG_REG_FRAME_CNT_TRGR_INT_MSK  (((1U << MJPEG_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << MJPEG_REG_FRAME_CNT_TRGR_INT_POS)
#define MJPEG_REG_FRAME_CNT_TRGR_INT_UMSK (~(((1U << MJPEG_REG_FRAME_CNT_TRGR_INT_LEN) - 1) << MJPEG_REG_FRAME_CNT_TRGR_INT_POS))
#define MJPEG_REG_INT_IDLE_EN             MJPEG_REG_INT_IDLE_EN
#define MJPEG_REG_INT_IDLE_EN_POS         (21U)
#define MJPEG_REG_INT_IDLE_EN_LEN         (1U)
#define MJPEG_REG_INT_IDLE_EN_MSK         (((1U << MJPEG_REG_INT_IDLE_EN_LEN) - 1) << MJPEG_REG_INT_IDLE_EN_POS)
#define MJPEG_REG_INT_IDLE_EN_UMSK        (~(((1U << MJPEG_REG_INT_IDLE_EN_LEN) - 1) << MJPEG_REG_INT_IDLE_EN_POS))
#define MJPEG_STS_IDLE_INT                MJPEG_STS_IDLE_INT
#define MJPEG_STS_IDLE_INT_POS            (22U)
#define MJPEG_STS_IDLE_INT_LEN            (1U)
#define MJPEG_STS_IDLE_INT_MSK            (((1U << MJPEG_STS_IDLE_INT_LEN) - 1) << MJPEG_STS_IDLE_INT_POS)
#define MJPEG_STS_IDLE_INT_UMSK           (~(((1U << MJPEG_STS_IDLE_INT_LEN) - 1) << MJPEG_STS_IDLE_INT_POS))
#define MJPEG_FRAME_VALID_CNT             MJPEG_FRAME_VALID_CNT
#define MJPEG_FRAME_VALID_CNT_POS         (24U)
#define MJPEG_FRAME_VALID_CNT_LEN         (5U)
#define MJPEG_FRAME_VALID_CNT_MSK         (((1U << MJPEG_FRAME_VALID_CNT_LEN) - 1) << MJPEG_FRAME_VALID_CNT_POS)
#define MJPEG_FRAME_VALID_CNT_UMSK        (~(((1U << MJPEG_FRAME_VALID_CNT_LEN) - 1) << MJPEG_FRAME_VALID_CNT_POS))
#define MJPEG_REG_INT_SWAP_EN             MJPEG_REG_INT_SWAP_EN
#define MJPEG_REG_INT_SWAP_EN_POS         (29U)
#define MJPEG_REG_INT_SWAP_EN_LEN         (1U)
#define MJPEG_REG_INT_SWAP_EN_MSK         (((1U << MJPEG_REG_INT_SWAP_EN_LEN) - 1) << MJPEG_REG_INT_SWAP_EN_POS)
#define MJPEG_REG_INT_SWAP_EN_UMSK        (~(((1U << MJPEG_REG_INT_SWAP_EN_LEN) - 1) << MJPEG_REG_INT_SWAP_EN_POS))
#define MJPEG_STS_SWAP_INT                MJPEG_STS_SWAP_INT
#define MJPEG_STS_SWAP_INT_POS            (30U)
#define MJPEG_STS_SWAP_INT_LEN            (1U)
#define MJPEG_STS_SWAP_INT_MSK            (((1U << MJPEG_STS_SWAP_INT_LEN) - 1) << MJPEG_STS_SWAP_INT_POS)
#define MJPEG_STS_SWAP_INT_UMSK           (~(((1U << MJPEG_STS_SWAP_INT_LEN) - 1) << MJPEG_STS_SWAP_INT_POS))

/* 0x20 : mjpeg_frame_fifo_pop */
#define MJPEG_FRAME_FIFO_POP_OFFSET   (0x20)
#define MJPEG_RFIFO_POP               MJPEG_RFIFO_POP
#define MJPEG_RFIFO_POP_POS           (0U)
#define MJPEG_RFIFO_POP_LEN           (1U)
#define MJPEG_RFIFO_POP_MSK           (((1U << MJPEG_RFIFO_POP_LEN) - 1) << MJPEG_RFIFO_POP_POS)
#define MJPEG_RFIFO_POP_UMSK          (~(((1U << MJPEG_RFIFO_POP_LEN) - 1) << MJPEG_RFIFO_POP_POS))
#define MJPEG_REG_W_SWAP_CLR          MJPEG_REG_W_SWAP_CLR
#define MJPEG_REG_W_SWAP_CLR_POS      (1U)
#define MJPEG_REG_W_SWAP_CLR_LEN      (1U)
#define MJPEG_REG_W_SWAP_CLR_MSK      (((1U << MJPEG_REG_W_SWAP_CLR_LEN) - 1) << MJPEG_REG_W_SWAP_CLR_POS)
#define MJPEG_REG_W_SWAP_CLR_UMSK     (~(((1U << MJPEG_REG_W_SWAP_CLR_LEN) - 1) << MJPEG_REG_W_SWAP_CLR_POS))
#define MJPEG_REG_INT_NORMAL_CLR      MJPEG_REG_INT_NORMAL_CLR
#define MJPEG_REG_INT_NORMAL_CLR_POS  (8U)
#define MJPEG_REG_INT_NORMAL_CLR_LEN  (1U)
#define MJPEG_REG_INT_NORMAL_CLR_MSK  (((1U << MJPEG_REG_INT_NORMAL_CLR_LEN) - 1) << MJPEG_REG_INT_NORMAL_CLR_POS)
#define MJPEG_REG_INT_NORMAL_CLR_UMSK (~(((1U << MJPEG_REG_INT_NORMAL_CLR_LEN) - 1) << MJPEG_REG_INT_NORMAL_CLR_POS))
#define MJPEG_REG_INT_CAM_CLR         MJPEG_REG_INT_CAM_CLR
#define MJPEG_REG_INT_CAM_CLR_POS     (9U)
#define MJPEG_REG_INT_CAM_CLR_LEN     (1U)
#define MJPEG_REG_INT_CAM_CLR_MSK     (((1U << MJPEG_REG_INT_CAM_CLR_LEN) - 1) << MJPEG_REG_INT_CAM_CLR_POS)
#define MJPEG_REG_INT_CAM_CLR_UMSK    (~(((1U << MJPEG_REG_INT_CAM_CLR_LEN) - 1) << MJPEG_REG_INT_CAM_CLR_POS))
#define MJPEG_REG_INT_MEM_CLR         MJPEG_REG_INT_MEM_CLR
#define MJPEG_REG_INT_MEM_CLR_POS     (10U)
#define MJPEG_REG_INT_MEM_CLR_LEN     (1U)
#define MJPEG_REG_INT_MEM_CLR_MSK     (((1U << MJPEG_REG_INT_MEM_CLR_LEN) - 1) << MJPEG_REG_INT_MEM_CLR_POS)
#define MJPEG_REG_INT_MEM_CLR_UMSK    (~(((1U << MJPEG_REG_INT_MEM_CLR_LEN) - 1) << MJPEG_REG_INT_MEM_CLR_POS))
#define MJPEG_REG_INT_FRAME_CLR       MJPEG_REG_INT_FRAME_CLR
#define MJPEG_REG_INT_FRAME_CLR_POS   (11U)
#define MJPEG_REG_INT_FRAME_CLR_LEN   (1U)
#define MJPEG_REG_INT_FRAME_CLR_MSK   (((1U << MJPEG_REG_INT_FRAME_CLR_LEN) - 1) << MJPEG_REG_INT_FRAME_CLR_POS)
#define MJPEG_REG_INT_FRAME_CLR_UMSK  (~(((1U << MJPEG_REG_INT_FRAME_CLR_LEN) - 1) << MJPEG_REG_INT_FRAME_CLR_POS))
#define MJPEG_REG_INT_IDLE_CLR        MJPEG_REG_INT_IDLE_CLR
#define MJPEG_REG_INT_IDLE_CLR_POS    (12U)
#define MJPEG_REG_INT_IDLE_CLR_LEN    (1U)
#define MJPEG_REG_INT_IDLE_CLR_MSK    (((1U << MJPEG_REG_INT_IDLE_CLR_LEN) - 1) << MJPEG_REG_INT_IDLE_CLR_POS)
#define MJPEG_REG_INT_IDLE_CLR_UMSK   (~(((1U << MJPEG_REG_INT_IDLE_CLR_LEN) - 1) << MJPEG_REG_INT_IDLE_CLR_POS))
#define MJPEG_REG_INT_SWAP_CLR        MJPEG_REG_INT_SWAP_CLR
#define MJPEG_REG_INT_SWAP_CLR_POS    (13U)
#define MJPEG_REG_INT_SWAP_CLR_LEN    (1U)
#define MJPEG_REG_INT_SWAP_CLR_MSK    (((1U << MJPEG_REG_INT_SWAP_CLR_LEN) - 1) << MJPEG_REG_INT_SWAP_CLR_POS)
#define MJPEG_REG_INT_SWAP_CLR_UMSK   (~(((1U << MJPEG_REG_INT_SWAP_CLR_LEN) - 1) << MJPEG_REG_INT_SWAP_CLR_POS))

