RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_reg.h
/* 0x24 : mjpeg_frame_size */
#define MJPEG_FRAME_SIZE_OFFSET   (0x24)
#define MJPEG_REG_FRAME_WBLK      MJPEG_REG_FRAME_WBLK
#define MJPEG_REG_FRAME_WBLK_POS  (0U)
#define MJPEG_REG_FRAME_WBLK_LEN  (12U)
#define MJPEG_REG_FRAME_WBLK_MSK  (((1U << MJPEG_REG_FRAME_WBLK_LEN) - 1) << MJPEG_REG_FRAME_WBLK_POS)
#define MJPEG_REG_FRAME_WBLK_UMSK (~(((1U << MJPEG_REG_FRAME_WBLK_LEN) - 1) << MJPEG_REG_FRAME_WBLK_POS))
#define MJPEG_REG_FRAME_HBLK      MJPEG_REG_FRAME_HBLK
#define MJPEG_REG_FRAME_HBLK_POS  (16U)
#define MJPEG_REG_FRAME_HBLK_LEN  (12U)
#define MJPEG_REG_FRAME_HBLK_MSK  (((1U << MJPEG_REG_FRAME_HBLK_LEN) - 1) << MJPEG_REG_FRAME_HBLK_POS)
#define MJPEG_REG_FRAME_HBLK_UMSK (~(((1U << MJPEG_REG_FRAME_HBLK_LEN) - 1) << MJPEG_REG_FRAME_HBLK_POS))

/* 0x28 : mjpeg_header_byte */
#define MJPEG_HEADER_BYTE_OFFSET (0x28)
#define MJPEG_REG_HEAD_BYTE      MJPEG_REG_HEAD_BYTE
#define MJPEG_REG_HEAD_BYTE_POS  (0U)
#define MJPEG_REG_HEAD_BYTE_LEN  (12U)
#define MJPEG_REG_HEAD_BYTE_MSK  (((1U << MJPEG_REG_HEAD_BYTE_LEN) - 1) << MJPEG_REG_HEAD_BYTE_POS)
#define MJPEG_REG_HEAD_BYTE_UMSK (~(((1U << MJPEG_REG_HEAD_BYTE_LEN) - 1) << MJPEG_REG_HEAD_BYTE_POS))
#define MJPEG_REG_TAIL_EXP       MJPEG_REG_TAIL_EXP
#define MJPEG_REG_TAIL_EXP_POS   (16U)
#define MJPEG_REG_TAIL_EXP_LEN   (1U)
#define MJPEG_REG_TAIL_EXP_MSK   (((1U << MJPEG_REG_TAIL_EXP_LEN) - 1) << MJPEG_REG_TAIL_EXP_POS)
#define MJPEG_REG_TAIL_EXP_UMSK  (~(((1U << MJPEG_REG_TAIL_EXP_LEN) - 1) << MJPEG_REG_TAIL_EXP_POS))
#define MJPEG_REG_Y0_ORDER       MJPEG_REG_Y0_ORDER
#define MJPEG_REG_Y0_ORDER_POS   (24U)
#define MJPEG_REG_Y0_ORDER_LEN   (2U)
#define MJPEG_REG_Y0_ORDER_MSK   (((1U << MJPEG_REG_Y0_ORDER_LEN) - 1) << MJPEG_REG_Y0_ORDER_POS)
#define MJPEG_REG_Y0_ORDER_UMSK  (~(((1U << MJPEG_REG_Y0_ORDER_LEN) - 1) << MJPEG_REG_Y0_ORDER_POS))
#define MJPEG_REG_U0_ORDER       MJPEG_REG_U0_ORDER
#define MJPEG_REG_U0_ORDER_POS   (26U)
#define MJPEG_REG_U0_ORDER_LEN   (2U)
#define MJPEG_REG_U0_ORDER_MSK   (((1U << MJPEG_REG_U0_ORDER_LEN) - 1) << MJPEG_REG_U0_ORDER_POS)
#define MJPEG_REG_U0_ORDER_UMSK  (~(((1U << MJPEG_REG_U0_ORDER_LEN) - 1) << MJPEG_REG_U0_ORDER_POS))
#define MJPEG_REG_Y1_ORDER       MJPEG_REG_Y1_ORDER
#define MJPEG_REG_Y1_ORDER_POS   (28U)
#define MJPEG_REG_Y1_ORDER_LEN   (2U)
#define MJPEG_REG_Y1_ORDER_MSK   (((1U << MJPEG_REG_Y1_ORDER_LEN) - 1) << MJPEG_REG_Y1_ORDER_POS)
#define MJPEG_REG_Y1_ORDER_UMSK  (~(((1U << MJPEG_REG_Y1_ORDER_LEN) - 1) << MJPEG_REG_Y1_ORDER_POS))
#define MJPEG_REG_V0_ORDER       MJPEG_REG_V0_ORDER
#define MJPEG_REG_V0_ORDER_POS   (30U)
#define MJPEG_REG_V0_ORDER_LEN   (2U)
#define MJPEG_REG_V0_ORDER_MSK   (((1U << MJPEG_REG_V0_ORDER_LEN) - 1) << MJPEG_REG_V0_ORDER_POS)
#define MJPEG_REG_V0_ORDER_UMSK  (~(((1U << MJPEG_REG_V0_ORDER_LEN) - 1) << MJPEG_REG_V0_ORDER_POS))

/* 0x30 : mjpeg_swap_mode */
#define MJPEG_SWAP_MODE_OFFSET       (0x30)
#define MJPEG_REG_W_SWAP_MODE        MJPEG_REG_W_SWAP_MODE
#define MJPEG_REG_W_SWAP_MODE_POS    (0U)
#define MJPEG_REG_W_SWAP_MODE_LEN    (1U)
#define MJPEG_REG_W_SWAP_MODE_MSK    (((1U << MJPEG_REG_W_SWAP_MODE_LEN) - 1) << MJPEG_REG_W_SWAP_MODE_POS)
#define MJPEG_REG_W_SWAP_MODE_UMSK   (~(((1U << MJPEG_REG_W_SWAP_MODE_LEN) - 1) << MJPEG_REG_W_SWAP_MODE_POS))
#define MJPEG_STS_SWAP0_FULL         MJPEG_STS_SWAP0_FULL
#define MJPEG_STS_SWAP0_FULL_POS     (8U)
#define MJPEG_STS_SWAP0_FULL_LEN     (1U)
#define MJPEG_STS_SWAP0_FULL_MSK     (((1U << MJPEG_STS_SWAP0_FULL_LEN) - 1) << MJPEG_STS_SWAP0_FULL_POS)
#define MJPEG_STS_SWAP0_FULL_UMSK    (~(((1U << MJPEG_STS_SWAP0_FULL_LEN) - 1) << MJPEG_STS_SWAP0_FULL_POS))
#define MJPEG_STS_SWAP1_FULL         MJPEG_STS_SWAP1_FULL
#define MJPEG_STS_SWAP1_FULL_POS     (9U)
#define MJPEG_STS_SWAP1_FULL_LEN     (1U)
#define MJPEG_STS_SWAP1_FULL_MSK     (((1U << MJPEG_STS_SWAP1_FULL_LEN) - 1) << MJPEG_STS_SWAP1_FULL_POS)
#define MJPEG_STS_SWAP1_FULL_UMSK    (~(((1U << MJPEG_STS_SWAP1_FULL_LEN) - 1) << MJPEG_STS_SWAP1_FULL_POS))
#define MJPEG_STS_READ_SWAP_IDX      MJPEG_STS_READ_SWAP_IDX
#define MJPEG_STS_READ_SWAP_IDX_POS  (10U)
#define MJPEG_STS_READ_SWAP_IDX_LEN  (1U)
#define MJPEG_STS_READ_SWAP_IDX_MSK  (((1U << MJPEG_STS_READ_SWAP_IDX_LEN) - 1) << MJPEG_STS_READ_SWAP_IDX_POS)
#define MJPEG_STS_READ_SWAP_IDX_UMSK (~(((1U << MJPEG_STS_READ_SWAP_IDX_LEN) - 1) << MJPEG_STS_READ_SWAP_IDX_POS))
#define MJPEG_STS_SWAP_FSTART        MJPEG_STS_SWAP_FSTART
#define MJPEG_STS_SWAP_FSTART_POS    (11U)
#define MJPEG_STS_SWAP_FSTART_LEN    (1U)
#define MJPEG_STS_SWAP_FSTART_MSK    (((1U << MJPEG_STS_SWAP_FSTART_LEN) - 1) << MJPEG_STS_SWAP_FSTART_POS)
#define MJPEG_STS_SWAP_FSTART_UMSK   (~(((1U << MJPEG_STS_SWAP_FSTART_LEN) - 1) << MJPEG_STS_SWAP_FSTART_POS))
#define MJPEG_STS_SWAP_FEND          MJPEG_STS_SWAP_FEND
#define MJPEG_STS_SWAP_FEND_POS      (12U)
#define MJPEG_STS_SWAP_FEND_LEN      (1U)
#define MJPEG_STS_SWAP_FEND_MSK      (((1U << MJPEG_STS_SWAP_FEND_LEN) - 1) << MJPEG_STS_SWAP_FEND_POS)
#define MJPEG_STS_SWAP_FEND_UMSK     (~(((1U << MJPEG_STS_SWAP_FEND_LEN) - 1) << MJPEG_STS_SWAP_FEND_POS))

/* 0x34 : mjpeg_swap_bit_cnt */
#define MJPEG_SWAP_BIT_CNT_OFFSET         (0x34)
#define MJPEG_FRAME_SWAP_END_BIT_CNT      MJPEG_FRAME_SWAP_END_BIT_CNT
#define MJPEG_FRAME_SWAP_END_BIT_CNT_POS  (0U)
#define MJPEG_FRAME_SWAP_END_BIT_CNT_LEN  (32U)
#define MJPEG_FRAME_SWAP_END_BIT_CNT_MSK  (((1U << MJPEG_FRAME_SWAP_END_BIT_CNT_LEN) - 1) << MJPEG_FRAME_SWAP_END_BIT_CNT_POS)
#define MJPEG_FRAME_SWAP_END_BIT_CNT_UMSK (~(((1U << MJPEG_FRAME_SWAP_END_BIT_CNT_LEN) - 1) << MJPEG_FRAME_SWAP_END_BIT_CNT_POS))

/* 0x38 : mjpeg_yuv_mem_sw */
#define MJPEG_YUV_MEM_SW_OFFSET     (0x38)
#define MJPEG_REG_SW_KICK_HBLK      MJPEG_REG_SW_KICK_HBLK
#define MJPEG_REG_SW_KICK_HBLK_POS  (0U)
#define MJPEG_REG_SW_KICK_HBLK_LEN  (13U)
#define MJPEG_REG_SW_KICK_HBLK_MSK  (((1U << MJPEG_REG_SW_KICK_HBLK_LEN) - 1) << MJPEG_REG_SW_KICK_HBLK_POS)
#define MJPEG_REG_SW_KICK_HBLK_UMSK (~(((1U << MJPEG_REG_SW_KICK_HBLK_LEN) - 1) << MJPEG_REG_SW_KICK_HBLK_POS))

/* 0x40 : mjpeg_Y_frame_read_status_1 */
#define MJPEG_Y_FRAME_READ_STATUS_1_OFFSET (0x40)
#define MJPEG_YY_MEM_HBLK_R                MJPEG_YY_MEM_HBLK_R
#define MJPEG_YY_MEM_HBLK_R_POS            (0U)
#define MJPEG_YY_MEM_HBLK_R_LEN            (13U)
#define MJPEG_YY_MEM_HBLK_R_MSK            (((1U << MJPEG_YY_MEM_HBLK_R_LEN) - 1) << MJPEG_YY_MEM_HBLK_R_POS)
#define MJPEG_YY_MEM_HBLK_R_UMSK           (~(((1U << MJPEG_YY_MEM_HBLK_R_LEN) - 1) << MJPEG_YY_MEM_HBLK_R_POS))
#define MJPEG_YY_FRM_HBLK_R                MJPEG_YY_FRM_HBLK_R
#define MJPEG_YY_FRM_HBLK_R_POS            (16U)
#define MJPEG_YY_FRM_HBLK_R_LEN            (13U)
#define MJPEG_YY_FRM_HBLK_R_MSK            (((1U << MJPEG_YY_FRM_HBLK_R_LEN) - 1) << MJPEG_YY_FRM_HBLK_R_POS)
#define MJPEG_YY_FRM_HBLK_R_UMSK           (~(((1U << MJPEG_YY_FRM_HBLK_R_LEN) - 1) << MJPEG_YY_FRM_HBLK_R_POS))

