RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_reg.h
/* 0x88 : mjpeg_start_addr1 */
#define MJPEG_START_ADDR1_OFFSET      (0x88)
#define MJPEG_FRAME_START_ADDR_1      MJPEG_FRAME_START_ADDR_1
#define MJPEG_FRAME_START_ADDR_1_POS  (0U)
#define MJPEG_FRAME_START_ADDR_1_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_1_MSK  (((1U << MJPEG_FRAME_START_ADDR_1_LEN) - 1) << MJPEG_FRAME_START_ADDR_1_POS)
#define MJPEG_FRAME_START_ADDR_1_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_1_LEN) - 1) << MJPEG_FRAME_START_ADDR_1_POS))

/* 0x8C : mjpeg_bit_cnt1 */
#define MJPEG_BIT_CNT1_OFFSET      (0x8C)
#define MJPEG_FRAME_BIT_CNT_1      MJPEG_FRAME_BIT_CNT_1
#define MJPEG_FRAME_BIT_CNT_1_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_1_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_1_MSK  (((1U << MJPEG_FRAME_BIT_CNT_1_LEN) - 1) << MJPEG_FRAME_BIT_CNT_1_POS)
#define MJPEG_FRAME_BIT_CNT_1_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_1_LEN) - 1) << MJPEG_FRAME_BIT_CNT_1_POS))

/* 0x90 : mjpeg_start_addr2 */
#define MJPEG_START_ADDR2_OFFSET      (0x90)
#define MJPEG_FRAME_START_ADDR_2      MJPEG_FRAME_START_ADDR_2
#define MJPEG_FRAME_START_ADDR_2_POS  (0U)
#define MJPEG_FRAME_START_ADDR_2_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_2_MSK  (((1U << MJPEG_FRAME_START_ADDR_2_LEN) - 1) << MJPEG_FRAME_START_ADDR_2_POS)
#define MJPEG_FRAME_START_ADDR_2_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_2_LEN) - 1) << MJPEG_FRAME_START_ADDR_2_POS))

/* 0x94 : mjpeg_bit_cnt2 */
#define MJPEG_BIT_CNT2_OFFSET      (0x94)
#define MJPEG_FRAME_BIT_CNT_2      MJPEG_FRAME_BIT_CNT_2
#define MJPEG_FRAME_BIT_CNT_2_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_2_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_2_MSK  (((1U << MJPEG_FRAME_BIT_CNT_2_LEN) - 1) << MJPEG_FRAME_BIT_CNT_2_POS)
#define MJPEG_FRAME_BIT_CNT_2_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_2_LEN) - 1) << MJPEG_FRAME_BIT_CNT_2_POS))

/* 0x98 : mjpeg_start_addr3 */
#define MJPEG_START_ADDR3_OFFSET      (0x98)
#define MJPEG_FRAME_START_ADDR_3      MJPEG_FRAME_START_ADDR_3
#define MJPEG_FRAME_START_ADDR_3_POS  (0U)
#define MJPEG_FRAME_START_ADDR_3_LEN  (32U)
#define MJPEG_FRAME_START_ADDR_3_MSK  (((1U << MJPEG_FRAME_START_ADDR_3_LEN) - 1) << MJPEG_FRAME_START_ADDR_3_POS)
#define MJPEG_FRAME_START_ADDR_3_UMSK (~(((1U << MJPEG_FRAME_START_ADDR_3_LEN) - 1) << MJPEG_FRAME_START_ADDR_3_POS))

/* 0x9C : mjpeg_bit_cnt3 */
#define MJPEG_BIT_CNT3_OFFSET      (0x9C)
#define MJPEG_FRAME_BIT_CNT_3      MJPEG_FRAME_BIT_CNT_3
#define MJPEG_FRAME_BIT_CNT_3_POS  (0U)
#define MJPEG_FRAME_BIT_CNT_3_LEN  (32U)
#define MJPEG_FRAME_BIT_CNT_3_MSK  (((1U << MJPEG_FRAME_BIT_CNT_3_LEN) - 1) << MJPEG_FRAME_BIT_CNT_3_POS)
#define MJPEG_FRAME_BIT_CNT_3_UMSK (~(((1U << MJPEG_FRAME_BIT_CNT_3_LEN) - 1) << MJPEG_FRAME_BIT_CNT_3_POS))

/* 0x100 : mjpeg_q_enc */
#define MJPEG_Q_ENC_OFFSET        (0x100)
#define MJPEG_FRAME_Q_SRAM_0      MJPEG_FRAME_Q_SRAM_0
#define MJPEG_FRAME_Q_SRAM_0_POS  (0U)
#define MJPEG_FRAME_Q_SRAM_0_LEN  (1U)
#define MJPEG_FRAME_Q_SRAM_0_MSK  (((1U << MJPEG_FRAME_Q_SRAM_0_LEN) - 1) << MJPEG_FRAME_Q_SRAM_0_POS)
#define MJPEG_FRAME_Q_SRAM_0_UMSK (~(((1U << MJPEG_FRAME_Q_SRAM_0_LEN) - 1) << MJPEG_FRAME_Q_SRAM_0_POS))
#define MJPEG_FRAME_Q_SRAM_1      MJPEG_FRAME_Q_SRAM_1
#define MJPEG_FRAME_Q_SRAM_1_POS  (1U)
#define MJPEG_FRAME_Q_SRAM_1_LEN  (1U)
#define MJPEG_FRAME_Q_SRAM_1_MSK  (((1U << MJPEG_FRAME_Q_SRAM_1_LEN) - 1) << MJPEG_FRAME_Q_SRAM_1_POS)
#define MJPEG_FRAME_Q_SRAM_1_UMSK (~(((1U << MJPEG_FRAME_Q_SRAM_1_LEN) - 1) << MJPEG_FRAME_Q_SRAM_1_POS))
#define MJPEG_FRAME_Q_SRAM_2      MJPEG_FRAME_Q_SRAM_2
#define MJPEG_FRAME_Q_SRAM_2_POS  (2U)
#define MJPEG_FRAME_Q_SRAM_2_LEN  (1U)
#define MJPEG_FRAME_Q_SRAM_2_MSK  (((1U << MJPEG_FRAME_Q_SRAM_2_LEN) - 1) << MJPEG_FRAME_Q_SRAM_2_POS)
#define MJPEG_FRAME_Q_SRAM_2_UMSK (~(((1U << MJPEG_FRAME_Q_SRAM_2_LEN) - 1) << MJPEG_FRAME_Q_SRAM_2_POS))
#define MJPEG_FRAME_Q_SRAM_3      MJPEG_FRAME_Q_SRAM_3
#define MJPEG_FRAME_Q_SRAM_3_POS  (3U)
#define MJPEG_FRAME_Q_SRAM_3_LEN  (1U)
#define MJPEG_FRAME_Q_SRAM_3_MSK  (((1U << MJPEG_FRAME_Q_SRAM_3_LEN) - 1) << MJPEG_FRAME_Q_SRAM_3_POS)
#define MJPEG_FRAME_Q_SRAM_3_UMSK (~(((1U << MJPEG_FRAME_Q_SRAM_3_LEN) - 1) << MJPEG_FRAME_Q_SRAM_3_POS))
#define MJPEG_REG_Q_SRAM_SW       MJPEG_REG_Q_SRAM_SW
#define MJPEG_REG_Q_SRAM_SW_POS   (24U)
#define MJPEG_REG_Q_SRAM_SW_LEN   (1U)
#define MJPEG_REG_Q_SRAM_SW_MSK   (((1U << MJPEG_REG_Q_SRAM_SW_LEN) - 1) << MJPEG_REG_Q_SRAM_SW_POS)
#define MJPEG_REG_Q_SRAM_SW_UMSK  (~(((1U << MJPEG_REG_Q_SRAM_SW_LEN) - 1) << MJPEG_REG_Q_SRAM_SW_POS))
#define MJPEG_STS_Q_SRAM_ENC      MJPEG_STS_Q_SRAM_ENC
#define MJPEG_STS_Q_SRAM_ENC_POS  (25U)
#define MJPEG_STS_Q_SRAM_ENC_LEN  (1U)
#define MJPEG_STS_Q_SRAM_ENC_MSK  (((1U << MJPEG_STS_Q_SRAM_ENC_LEN) - 1) << MJPEG_STS_Q_SRAM_ENC_POS)
#define MJPEG_STS_Q_SRAM_ENC_UMSK (~(((1U << MJPEG_STS_Q_SRAM_ENC_LEN) - 1) << MJPEG_STS_Q_SRAM_ENC_POS))

/* 0x110 : mjpeg_frame_id_10 */
#define MJPEG_FRAME_ID_10_OFFSET (0x110)
#define MJPEG_FRAME_ID_0         MJPEG_FRAME_ID_0
#define MJPEG_FRAME_ID_0_POS     (0U)
#define MJPEG_FRAME_ID_0_LEN     (16U)
#define MJPEG_FRAME_ID_0_MSK     (((1U << MJPEG_FRAME_ID_0_LEN) - 1) << MJPEG_FRAME_ID_0_POS)
#define MJPEG_FRAME_ID_0_UMSK    (~(((1U << MJPEG_FRAME_ID_0_LEN) - 1) << MJPEG_FRAME_ID_0_POS))
#define MJPEG_FRAME_ID_1         MJPEG_FRAME_ID_1
#define MJPEG_FRAME_ID_1_POS     (16U)
#define MJPEG_FRAME_ID_1_LEN     (16U)
#define MJPEG_FRAME_ID_1_MSK     (((1U << MJPEG_FRAME_ID_1_LEN) - 1) << MJPEG_FRAME_ID_1_POS)
#define MJPEG_FRAME_ID_1_UMSK    (~(((1U << MJPEG_FRAME_ID_1_LEN) - 1) << MJPEG_FRAME_ID_1_POS))

/* 0x114 : mjpeg_frame_id_32 */
#define MJPEG_FRAME_ID_32_OFFSET (0x114)
#define MJPEG_FRAME_ID_2         MJPEG_FRAME_ID_2
#define MJPEG_FRAME_ID_2_POS     (0U)
#define MJPEG_FRAME_ID_2_LEN     (16U)
#define MJPEG_FRAME_ID_2_MSK     (((1U << MJPEG_FRAME_ID_2_LEN) - 1) << MJPEG_FRAME_ID_2_POS)
#define MJPEG_FRAME_ID_2_UMSK    (~(((1U << MJPEG_FRAME_ID_2_LEN) - 1) << MJPEG_FRAME_ID_2_POS))
#define MJPEG_FRAME_ID_3         MJPEG_FRAME_ID_3
#define MJPEG_FRAME_ID_3_POS     (16U)
#define MJPEG_FRAME_ID_3_LEN     (16U)
#define MJPEG_FRAME_ID_3_MSK     (((1U << MJPEG_FRAME_ID_3_LEN) - 1) << MJPEG_FRAME_ID_3_POS)
#define MJPEG_FRAME_ID_3_UMSK    (~(((1U << MJPEG_FRAME_ID_3_LEN) - 1) << MJPEG_FRAME_ID_3_POS))

/* 0x1F0 : mjpeg_debug */
#define MJPEG_DEBUG_OFFSET           (0x1F0)
#define MJPEG_REG_MJPEG_DBG_EN       MJPEG_REG_MJPEG_DBG_EN
#define MJPEG_REG_MJPEG_DBG_EN_POS   (0U)
#define MJPEG_REG_MJPEG_DBG_EN_LEN   (1U)
#define MJPEG_REG_MJPEG_DBG_EN_MSK   (((1U << MJPEG_REG_MJPEG_DBG_EN_LEN) - 1) << MJPEG_REG_MJPEG_DBG_EN_POS)
#define MJPEG_REG_MJPEG_DBG_EN_UMSK  (~(((1U << MJPEG_REG_MJPEG_DBG_EN_LEN) - 1) << MJPEG_REG_MJPEG_DBG_EN_POS))
#define MJPEG_REG_MJPEG_DBG_SEL      MJPEG_REG_MJPEG_DBG_SEL
#define MJPEG_REG_MJPEG_DBG_SEL_POS  (4U)
#define MJPEG_REG_MJPEG_DBG_SEL_LEN  (4U)
#define MJPEG_REG_MJPEG_DBG_SEL_MSK  (((1U << MJPEG_REG_MJPEG_DBG_SEL_LEN) - 1) << MJPEG_REG_MJPEG_DBG_SEL_POS)
#define MJPEG_REG_MJPEG_DBG_SEL_UMSK (~(((1U << MJPEG_REG_MJPEG_DBG_SEL_LEN) - 1) << MJPEG_REG_MJPEG_DBG_SEL_POS))
#define MJPEG_REG_ID_LATCH_HBLK      MJPEG_REG_ID_LATCH_HBLK
#define MJPEG_REG_ID_LATCH_HBLK_POS  (8U)
#define MJPEG_REG_ID_LATCH_HBLK_LEN  (4U)
#define MJPEG_REG_ID_LATCH_HBLK_MSK  (((1U << MJPEG_REG_ID_LATCH_HBLK_LEN) - 1) << MJPEG_REG_ID_LATCH_HBLK_POS)
#define MJPEG_REG_ID_LATCH_HBLK_UMSK (~(((1U << MJPEG_REG_ID_LATCH_HBLK_LEN) - 1) << MJPEG_REG_ID_LATCH_HBLK_POS))

/* 0x1FC : mjpeg_dummy_reg */
#define MJPEG_DUMMY_REG_OFFSET (0x1FC)
#define MJPEG_DUMMY_REG        MJPEG_DUMMY_REG
#define MJPEG_DUMMY_REG_POS    (0U)
#define MJPEG_DUMMY_REG_LEN    (32U)
#define MJPEG_DUMMY_REG_MSK    (((1U << MJPEG_DUMMY_REG_LEN) - 1) << MJPEG_DUMMY_REG_POS)
#define MJPEG_DUMMY_REG_UMSK   (~(((1U << MJPEG_DUMMY_REG_LEN) - 1) << MJPEG_DUMMY_REG_POS))

struct mjpeg_reg {
    /* 0x0 : mjpeg_control_1 */
    union {
        struct {
            uint32_t reg_mjpeg_enable     : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reg_mjpeg_bit_order  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reg_order_u_even     : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3           : 1;  /* [    3],       rsvd,        0x0 */
            uint32_t reg_last_hf_wblk_dmy : 1;  /* [    4],        r/w,        0x0 */
            uint32_t reg_last_hf_hblk_dmy : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reg_reflect_dmy      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reg_read_fwrap       : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reg_w_xlen           : 3;  /* [10: 8],        r/w,        0x3 */
            uint32_t reserved_11          : 1;  /* [   11],       rsvd,        0x0 */
            uint32_t reg_yuv_mode         : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_23       : 10; /* [23:14],       rsvd,        0x0 */
            uint32_t reg_mjpeg_hw_frame   : 6;  /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31       : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_control_1;

    /* 0x4 : mjpeg_control_2 */
    union {
        struct {
            uint32_t reg_sw_frame         : 5;  /* [ 4: 0],        r/w,        0x0 */
            uint32_t reserved_5           : 1;  /* [    5],       rsvd,        0x0 */
            uint32_t reg_sw_kick          : 1;  /* [    6],        w1p,        0x0 */
            uint32_t reg_sw_kick_mode     : 1;  /* [    7],        r/w,        0x0 */
            uint32_t reg_mjpeg_sw_mode    : 1;  /* [    8],        r/w,        0x0 */
            uint32_t reg_mjpeg_sw_run     : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reg_yy_dvp2axi_sel   : 3;  /* [12:10],        r/w,        0x0 */
            uint32_t reg_uv_dvp2axi_sel   : 3;  /* [15:13],        r/w,        0x1 */
            uint32_t reg_mjpeg_wait_cycle : 16; /* [31:16],        r/w,      0x100 */
        } BF;
        uint32_t WORD;
    } mjpeg_control_2;

    /* 0x08 : mjpeg_yy_frame_addr */
    union {
        struct {
            uint32_t reg_yy_addr_start : 32; /* [31: 0],        r/w, 0x80000000 */
        } BF;
        uint32_t WORD;
    } mjpeg_yy_frame_addr;

