RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_reg.h
    /* 0x0C : mjpeg_uv_frame_addr */
    union {
        struct {
            uint32_t reg_uv_addr_start : 32; /* [31: 0],        r/w, 0x80000000 */
        } BF;
        uint32_t WORD;
    } mjpeg_uv_frame_addr;

    /* 0x10 : mjpeg_yuv_mem */
    union {
        struct {
            uint32_t reg_yy_mem_hblk : 13; /* [12: 0],        r/w,        0x2 */
            uint32_t reserved_13_15  : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t reg_uv_mem_hblk : 13; /* [28:16],        r/w,        0x2 */
            uint32_t reserved_29_31  : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_yuv_mem;

    /* 0x14 : jpeg_frame_addr */
    union {
        struct {
            uint32_t reg_w_addr_start : 32; /* [31: 0],        r/w, 0x80400000 */
        } BF;
        uint32_t WORD;
    } jpeg_frame_addr;

    /* 0x18 : jpeg_store_memory */
    union {
        struct {
            uint32_t reg_w_burst_cnt : 32; /* [31: 0],        r/w,     0x4000 */
        } BF;
        uint32_t WORD;
    } jpeg_store_memory;

    /* 0x1C : mjpeg_control_3 */
    union {
        struct {
            uint32_t reg_int_normal_en      : 1; /* [    0],        r/w,        0x1 */
            uint32_t reg_int_cam_en         : 1; /* [    1],        r/w,        0x1 */
            uint32_t reg_int_mem_en         : 1; /* [    2],        r/w,        0x0 */
            uint32_t reg_int_frame_en       : 1; /* [    3],        r/w,        0x0 */
            uint32_t sts_normal_int         : 1; /* [    4],          r,        0x0 */
            uint32_t sts_cam_int            : 1; /* [    5],          r,        0x0 */
            uint32_t sts_mem_int            : 1; /* [    6],          r,        0x0 */
            uint32_t sts_frame_int          : 1; /* [    7],          r,        0x0 */
            uint32_t mjpeg_idle             : 1; /* [    8],          r,        0x1 */
            uint32_t mjpeg_func             : 1; /* [    9],          r,        0x0 */
            uint32_t mjpeg_wait             : 1; /* [   10],          r,        0x0 */
            uint32_t mjpeg_flsh             : 1; /* [   11],          r,        0x0 */
            uint32_t mjpeg_mans             : 1; /* [   12],          r,        0x0 */
            uint32_t mjpeg_manf             : 1; /* [   13],          r,        0x0 */
            uint32_t axi_read_idle          : 1; /* [   14],          r,        0x0 */
            uint32_t axi_write_idle         : 1; /* [   15],          r,        0x0 */
            uint32_t reg_frame_cnt_trgr_int : 5; /* [20:16],        r/w,        0x0 */
            uint32_t reg_int_idle_en        : 1; /* [   21],        r/w,        0x0 */
            uint32_t sts_idle_int           : 1; /* [   22],          r,        0x0 */
            uint32_t reserved_23            : 1; /* [   23],       rsvd,        0x0 */
            uint32_t frame_valid_cnt        : 5; /* [28:24],          r,        0x0 */
            uint32_t reg_int_swap_en        : 1; /* [   29],        r/w,        0x0 */
            uint32_t sts_swap_int           : 1; /* [   30],          r,        0x0 */
            uint32_t reserved_31            : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_control_3;

    /* 0x20 : mjpeg_frame_fifo_pop */
    union {
        struct {
            uint32_t rfifo_pop          : 1;  /* [    0],        w1p,        0x0 */
            uint32_t reg_w_swap_clr     : 1;  /* [    1],        w1p,        0x0 */
            uint32_t reserved_2_7       : 6;  /* [ 7: 2],       rsvd,        0x0 */
            uint32_t reg_int_normal_clr : 1;  /* [    8],        w1p,        0x0 */
            uint32_t reg_int_cam_clr    : 1;  /* [    9],        w1p,        0x0 */
            uint32_t reg_int_mem_clr    : 1;  /* [   10],        w1p,        0x0 */
            uint32_t reg_int_frame_clr  : 1;  /* [   11],        w1p,        0x0 */
            uint32_t reg_int_idle_clr   : 1;  /* [   12],        w1p,        0x0 */
            uint32_t reg_int_swap_clr   : 1;  /* [   13],        w1p,        0x0 */
            uint32_t reserved_14_31     : 18; /* [31:14],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_frame_fifo_pop;

    /* 0x24 : mjpeg_frame_size */
    union {
        struct {
            uint32_t reg_frame_wblk : 12; /* [11: 0],        r/w,        0xf */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_frame_hblk : 12; /* [27:16],        r/w,       0x14 */
            uint32_t reserved_28_31 : 4;  /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_frame_size;

    /* 0x28 : mjpeg_header_byte */
    union {
        struct {
            uint32_t reg_head_byte  : 12; /* [11: 0],        r/w,        0x0 */
            uint32_t reserved_12_15 : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t reg_tail_exp   : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_23 : 7;  /* [23:17],       rsvd,        0x0 */
            uint32_t reg_y0_order   : 2;  /* [25:24],        r/w,        0x0 */
            uint32_t reg_u0_order   : 2;  /* [27:26],        r/w,        0x1 */
            uint32_t reg_y1_order   : 2;  /* [29:28],        r/w,        0x2 */
            uint32_t reg_v0_order   : 2;  /* [31:30],        r/w,        0x3 */
        } BF;
        uint32_t WORD;
    } mjpeg_header_byte;

    /* 0x2c  reserved */
    uint8_t RESERVED0x2c[4];

    /* 0x30 : mjpeg_swap_mode */
    union {
        struct {
            uint32_t reg_w_swap_mode   : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_7      : 7;  /* [ 7: 1],       rsvd,        0x0 */
            uint32_t sts_swap0_full    : 1;  /* [    8],          r,        0x0 */
            uint32_t sts_swap1_full    : 1;  /* [    9],          r,        0x0 */
            uint32_t sts_read_swap_idx : 1;  /* [   10],          r,        0x0 */
            uint32_t sts_swap_fstart   : 1;  /* [   11],          r,        0x0 */
            uint32_t sts_swap_fend     : 1;  /* [   12],          r,        0x0 */
            uint32_t reserved_13_31    : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_swap_mode;

