RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/regs/mjpeg_reg.h
    /* 0x34 : mjpeg_swap_bit_cnt */
    union {
        struct {
            uint32_t frame_swap_end_bit_cnt : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_swap_bit_cnt;

    /* 0x38 : mjpeg_yuv_mem_sw */
    union {
        struct {
            uint32_t reg_sw_kick_hblk : 13; /* [12: 0],        r/w,        0x2 */
            uint32_t reserved_13_31   : 19; /* [31:13],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_yuv_mem_sw;

    /* 0x3c  reserved */
    uint8_t RESERVED0x3c[4];

    /* 0x40 : mjpeg_Y_frame_read_status_1 */
    union {
        struct {
            uint32_t yy_mem_hblk_r  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t yy_frm_hblk_r  : 13; /* [28:16],          r,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_Y_frame_read_status_1;

    /* 0x44 : mjpeg_Y_frame_read_status_2 */
    union {
        struct {
            uint32_t yy_wblk_r      : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t yy_mem_rnd_r   : 8;  /* [23:16],          r,        0x0 */
            uint32_t yy_frm_cnt_r   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_Y_frame_read_status_2;

    /* 0x48 : mjpeg_Y_frame_write_status */
    union {
        struct {
            uint32_t yy_mem_hblk_w  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t yy_mem_rnd_w   : 8;  /* [23:16],          r,        0x0 */
            uint32_t yy_frm_cnt_w   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_Y_frame_write_status;

    /* 0x4C : mjpeg_UV_frame_read_status_1 */
    union {
        struct {
            uint32_t uv_mem_hblk_r  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t uv_frm_hblk_r  : 13; /* [28:16],          r,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_UV_frame_read_status_1;

    /* 0x50 : mjpeg_UV_frame_read_status_2 */
    union {
        struct {
            uint32_t uv_wblk_r      : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t uv_mem_rnd_r   : 8;  /* [23:16],          r,        0x0 */
            uint32_t uv_frm_cnt_r   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_UV_frame_read_status_2;

    /* 0x54 : mjpeg_UV_frame_write_status */
    union {
        struct {
            uint32_t uv_mem_hblk_w  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t uv_mem_rnd_w   : 8;  /* [23:16],          r,        0x0 */
            uint32_t uv_frm_cnt_w   : 8;  /* [31:24],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_UV_frame_write_status;

    /* 0x58 : mjpeg_frame_w_hblk_status */
    union {
        struct {
            uint32_t yy_frm_hblk_w  : 13; /* [12: 0],          r,        0x0 */
            uint32_t reserved_13_15 : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t uv_frm_hblk_w  : 13; /* [28:16],          r,        0x0 */
            uint32_t reserved_29_31 : 3;  /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_frame_w_hblk_status;

    /* 0x5c  reserved */
    uint8_t RESERVED0x5c[36];

    /* 0x80 : mjpeg_start_addr0 */
    union {
        struct {
            uint32_t frame_start_addr_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr0;

    /* 0x84 : mjpeg_bit_cnt0 */
    union {
        struct {
            uint32_t frame_bit_cnt_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt0;

    /* 0x88 : mjpeg_start_addr1 */
    union {
        struct {
            uint32_t frame_start_addr_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr1;

    /* 0x8C : mjpeg_bit_cnt1 */
    union {
        struct {
            uint32_t frame_bit_cnt_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt1;

    /* 0x90 : mjpeg_start_addr2 */
    union {
        struct {
            uint32_t frame_start_addr_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr2;

    /* 0x94 : mjpeg_bit_cnt2 */
    union {
        struct {
            uint32_t frame_bit_cnt_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt2;

    /* 0x98 : mjpeg_start_addr3 */
    union {
        struct {
            uint32_t frame_start_addr_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_start_addr3;

    /* 0x9C : mjpeg_bit_cnt3 */
    union {
        struct {
            uint32_t frame_bit_cnt_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_bit_cnt3;

    /* 0xa0  reserved */
    uint8_t RESERVED0xa0[96];

    /* 0x100 : mjpeg_q_enc */
    union {
        struct {
            uint32_t frame_q_sram_0 : 1;  /* [    0],          r,        0x0 */
            uint32_t frame_q_sram_1 : 1;  /* [    1],          r,        0x0 */
            uint32_t frame_q_sram_2 : 1;  /* [    2],          r,        0x0 */
            uint32_t frame_q_sram_3 : 1;  /* [    3],          r,        0x0 */
            uint32_t reserved_4_23  : 20; /* [23: 4],       rsvd,        0x0 */
            uint32_t reg_q_sram_sw  : 1;  /* [   24],        w1p,        0x0 */
            uint32_t sts_q_sram_enc : 1;  /* [   25],          r,        0x0 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_q_enc;

    /* 0x104  reserved */
    uint8_t RESERVED0x104[12];

    /* 0x110 : mjpeg_frame_id_10 */
    union {
        struct {
            uint32_t frame_id_0 : 16; /* [15: 0],          r,        0x0 */
            uint32_t frame_id_1 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_frame_id_10;

    /* 0x114 : mjpeg_frame_id_32 */
    union {
        struct {
            uint32_t frame_id_2 : 16; /* [15: 0],          r,        0x0 */
            uint32_t frame_id_3 : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_frame_id_32;

    /* 0x118  reserved */
    uint8_t RESERVED0x118[216];

    /* 0x1F0 : mjpeg_debug */
    union {
        struct {
            uint32_t reg_mjpeg_dbg_en  : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3      : 3;  /* [ 3: 1],       rsvd,        0x0 */
            uint32_t reg_mjpeg_dbg_sel : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t reg_id_latch_hblk : 4;  /* [11: 8],        r/w,        0x1 */
            uint32_t reserved_12_31    : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_debug;

    /* 0x1f4  reserved */
    uint8_t RESERVED0x1f4[8];

    /* 0x1FC : mjpeg_dummy_reg */
    union {
        struct {
            uint32_t mjpeg_dummy_reg : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } mjpeg_dummy_reg;
};

typedef volatile struct mjpeg_reg mjpeg_reg_t;

#endif /* __MJPEG_REG_H__ */
